app/views/users/show.html.erb

<ul class="nav nav-tabs">
 <li class="<%= "active" if params[:tab].nil? %>"><%= link_to "Posts(#{@user.comments.size})", user_path(@user) %></li>
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]