app/views/posts/_form.html.erb

<div class="controll-group">
<%= collection_check_boxes(:post, :category_ids, Category.all, :id, :name) do |cb| %>
---
SELECT "categories".* FROM "categories"