app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 24 Apr 2014 16:54:23 UTC +00:00], ["name", "hocky"], ["updated_at", Thu, 24 Apr 2014 16:54:23 UTC +00:00]]
---
  def create
    @category = Category.new(params.require(:category).permit(:name))
	 if @category.save