app/controllers/comments_controller.rb

	def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params.require(:comment).permit(:body))
    @comment.creator = current_user


    if @comment.save
      flash[:notice] = "Your comment was added!"
      redirect_to post_path(@post)
    else
      @post = Post.find(params[:post_id]) # Added to prevent unsaved comment being listed on posts/show/:id
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "9"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "hoi dit is een comment"], ["created_at", Tue, 29 Apr 2014 10:23:48 UTC +00:00], ["post_id", 9], ["updated_at", Tue, 29 Apr 2014 10:23:48 UTC +00:00], ["user_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 9]]

  def vote
    comment = Comment.find(params[:id])
    vote= Vote.create(voteable: comment,creator: current_user,vote: params[:vote])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "7"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 06 May 2014 19:08:15 UTC +00:00], ["updated_at", Tue, 06 May 2014 19:08:15 UTC +00:00], ["user_id", 1], ["vote", true], ["voteable_id", 7], ["voteable_type", "Comment"]]