app/controllers/posts_controller.rb

  def index
  	@posts = Post.all
  	@user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]