app/controllers/posts_controller.rb

  def index
  	@posts = Post.all.sort_by{|x| x.total_votes}.reverse
---
SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "votes" WHERE "votes"."vote" = 't'

  def create
    @post = Post.new(post_params)
    @post.creator = current_user
    if @post.save
---
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 24 Apr 2014 15:11:28 UTC +00:00], ["description", "ddddddddddd"], ["title", "heb ik een user id "], ["updated_at", Thu, 24 Apr 2014 15:11:28 UTC +00:00], ["url", "ddd"]]

  def update
  	if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = 8  [["title", "heb ik e"], ["description", "waar gaat ditssover "], ["updated_at", Thu, 24 Apr 2014 16:15:26 UTC +00:00]]

  def vote
    vote = Vote.create(voteable: @post,creator: current_user,vote: params[:vote])
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 07 May 2014 08:47:18 UTC +00:00], ["updated_at", Wed, 07 May 2014 08:47:18 UTC +00:00], ["user_id", 1], ["vote", true], ["voteable_id", 3], ["voteable_type", "Post"]]

 def find_post
 	@post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 1]]